content/posts/on_effectively_scaling_engineering_teams.md
---
title: "On Effectively Scaling Engineering Teams"
author: ["Darrell Banks"]
date: 2025-01-06T00:00:00-07:00
draft: false
---

**Link**: [Engineering]({{< relref "engineering.md" >}})


## How do you scale engineering teams and culture? {#how-do-you-scale-engineering-teams-and-culture}

-   Each component in a system shoulnd have a single, well-defined
    responsibility and there should be minimal dependency between other
    components in the system.

-   Communication acrorss teams should have low bandwidth, anb be
    limited to when the teams are working on new ideas or building proof
    of concepts, as that requires a collective and broader outlook
    towards solving problems.

-   High-performing engineering teams are built on "services for teams"
    not "teams for services". Every service or component should be owned
    by exactly one team. In the event that a service or component is
    shared between multiple teams, one of the teams should claim ownership

    [reference](https://leaddev.com/velocity/8-principles-effectively-scaling-engineering-teams)
